[
    "What was your funnest subject in high school & which one did you dread?",
    "What is one attribute of your mother that you see in yourself?",
    "How did your mother and father meet?",
    "Who would you like to have a closer relationship with?",
    "What do you think happens to you when you die?",
    "Would you rather be on the cover of Time, People or Food & Wine magazine?",
    "What would you do with one week to do anything, all expenses paid?",
    "Would you rather be a painter, writer or musician?",
    "Do you think you are hard on yourself?",
    "Do you have any phobias?",
    "When home alone, do you shut the door when you use the bathroom?",
    "If you could afford it at this moment, what would you buy?",
    "What is the greatest goal you want to achieve in the next five years?",
    "What are five things you are grateful for?",
    "If you could own the world’s largest collection of anything, what would it be?",
    "What is the most boring thing you can think of doing?",
    "What one month on the calendar would you like to eliminate?",
    "What age would you like to be for the rest of your life?",
    "What would you like to build if you knew how?",
    "What signs of aging are you starting to see in yourself?",
    "What is your favorite smell?",
    "What was your favorite toy as a kid?",
    "Would you rather skydive or bungee jump?",
    "What is your ideal type of party to attend?",
    "Who was your favorite teacher and why?",
    "What was your favorite family tradition?",
    "Have you ever won anything?",
    "Who was the best boss you ever had?",
    "What would an ideal day look like?",
    "Which game show would you like to be on?",
    "If you weren’t doing what you do now for a career, what would you do?",
    "If you won a multi-million dollar lottery what would you do with the money?",
    "What famous person would you want to meet?",
    "What is your favorite memory about us?",
    "Would you like to be famous? For what?",
    "If you could change something about the way you were raised what would it be?",
    "What super power do you wish you had?",
    "Have you ever stolen anything before?",
    "What grosses you out?",
    "Did you have any pets growing up?",
    "What is the scariest thing you’ve ever done?",
    "When’s the last time you cried?",
    "What do you hope your life looks like in five years?",
    "What do you want to be remembered for?",
    "What is one thing you wish that you were really good at?",
    "What is your favorite childhood memory?",
    "What did you want to be when you grew up?",
    "What did your parent name you after?",
    "What hobby would you like to take up together?",
    "What is the worst job you ever had?"   
    "What values are most important to you in our relationship?",
    "How can we support each other's personal growth?",
    "What does intimacy mean to you?",
    "What shared goals should we work towards this year?",
    "What are some of your happiest memories with me?",
    "How do you envision our future together?",
    "What are some ways we can strengthen our trust?",
    "How can I make you feel more loved and appreciated?",
    "What are your thoughts on balancing career and family?",
    "What new traditions can we start together?",
    "What do you love most about our life together?",
    "How do you feel about the way we communicate?",
    "What is your favorite way to receive affection?",
    "What adventures would you like to experience with me?",
    "What do you think is the key to a lasting marriage?",
    "How can we make our daily lives more romantic?",
    "What are your thoughts on spirituality and its role in our marriage?",
    "What have you always wanted to tell me but haven't yet?",
    "How can we better handle disagreements or arguments?",
    "What qualities do you respect most in me?",
    "What can we do to keep our relationship exciting?",
    "What personal goals would you like my support with?",
    "What is something you've always wanted to learn and do you want to learn it together?",
    "How do you feel about our division of responsibilities at home?",
    "What does a perfect day look like for you?",
    "What are some of your fears about our relationship and how can we address them?",
    "What do you find most fulfilling about our relationship?",
    "How do you prefer to resolve conflicts?",
    "What are your expectations of me that you haven't expressed?",
    "How has our relationship changed you?",
    "What do you need from me that you're not currently getting?",
    "What aspect of your life would you like to improve the most?",
    "How can we support each other's dreams?",
    "What makes you feel most alive?",
    "What memories from your childhood do you want to recreate or avoid?",
    "What is your idea of a romantic getaway?",
    "How do you feel about our sex life currently?",
    "What stresses are you facing now and how can I help?",
    "What are the biggest strengths in our marriage?",
    "What do you think we need to work on the most in our relationship?",
    "What do you think makes us different from other couples?",
    "How do you feel about the time we spend apart?",
    "What brings you the most joy in our relationship?",
    "How do you want to be supported when you're struggling?",
    "What are your thoughts on finances and budgeting together?",
    "What has been your favorite age so far and why?",
    "What lessons have you learned from past relationships?",
    "How do you feel about the level of affection between us?",
    "What activities would you like to do together that we haven't tried yet?",
    "What are your hopes for our relationship?",
    "What do you feel is lacking in our relationship?",
    "How do you feel about starting or growing our family?",
    "What does work-life balance mean to you?",
    "What role does fitness and health play in your life?",
    "How do you feel about the way we handle disagreements?",
    "What is something you'd like to change about our daily routine?",
    "What do you want to achieve by the end of this year?",
    "What is your favorite memory of us from the last year?",
    "How do you feel about our social life and time with friends?",
    "What is something you admire about other couples?",
    "How do you feel about the pace of our life?",
    "What are some of your long-term goals?",
    "How do you feel about our level of independence within our relationship?",
    "What makes you feel most connected to me?",
    "How do you think we can better understand each other?",
    "What's something new you'd like to try in bed?",
    "How do you feel about the way we divide our time between families?",
    "What do you think about couple's therapy or marriage workshops?",
    "What's the most important lesson you've learned in life?",
    "What are your thoughts on how we celebrate holidays and special occasions?",
    "What are the non-negotiables in our relationship?",
    "How do you feel about my relationship with your family?",
    "What can I do to make you feel more secure in our future?",
    "What's one thing you think could improve our communication?",
    "What are your thoughts on how we manage our finances?",
    "What do you think we should prioritize in our lives right now?",
    "What are some of your smaller goals right now?",
    "How do you want to be remembered?",
    "What are your top three priorities in life right now?",
    "What's a fear you've overcome and how did you do it?",
    "What's something you've always wanted to do with me but haven't mentioned?",
    "What does self-care mean to you and how can we incorporate it into our routine?",
    "What's your favorite way to spend time as a couple?",
    "What's one thing you've learned from our relationship?",
    "How can we be better partners to each other?",
    "What's the most romantic thing you've ever thought of doing?",
    "What does your ideal retirement look like?",
    "What's something from your bucket list that we can do together?",
    "How do you feel about the level of passion in our relationship?",
    "What's one thing you'd like to create together?",
    "How do you feel about public displays of affection?",
    "What's one dream you have for us as a couple?",
    "What is the meaning of a good life?",
    "Is there absolute morality or is it all relative?",
    "Does free will truly exist?",
    "What does it mean to live authentically?",
    "Is the mind different from the brain?",
    "Can we ever experience anything objectively?",
    "What is the best form of government and why?",
    "Is there a meaning to life, and if so, what is it?",
    "What is the role of art in society?",
    "Does suffering make us stronger and lead to personal growth?",
    "Can knowledge exist without language?",
    "What is consciousness?",
    "Do animals have rights equal to humans?",
    "What is the greatest value that guides your life?",
    "Is it better to have loved and lost than never to have loved at all?",
    "Can we prove anything with absolute certainty?",
    "Is it possible to live a moral life without religion?",
    "How do we know what is real?",
    "What is the best way to live?",
    "Should we always tell the truth?",
    "Is it more important to be respected or liked?",
    "Is happiness the most important purpose in life?",
    "What is the nature of reality?",
    "Is there a rationale to life without the concept of God?",
    "What constitutes true freedom?",
    "Is it worse to fail at something or never attempt it in the first place?",
    "If you could choose just one thing to change about the world, what would it be?",
    "Is it more important to be fair or kind?",
    "What is more real, mind or matter?",
    "Is there such a thing as fate or destiny?",
    "Is it possible to live a virtuous life and still enjoy life's pleasures?",
    "What is beauty?",
    "How important is privacy?",
    "What is the most important right our government allows for?",
    "Can people be truly altruistic?",
    "What is the difference between living and being alive?",
    "Is a life that focuses on avoiding pain and seeking out pleasure a good and worthwhile life? Why or why not?",
    "Does the study of philosophy ever lead to answers or simply more questions?",
    "What is the best path to find truth; science, math, art, philosophy, or something else?",
    "Is trust more important than love?",
    "Is it easier to love or be loved?",
    "Should people care more about doing the right thing, or doing things right?",
    "What is the difference between justice and fairness?",
    "Which is more real: the past, the future, or the present?",
    "Do you think that humans are inherently good or bad?",
    "Is it more important to be successful or happy?",
    "Do we love ourselves more in the virtual world and less in the real world?",
    "Can you have happiness without sadness?",
    "What is the purpose of art?",
    "Does sound happen if nothing is present to hear it?",
    "Is it better to be open-minded or have strong convictions?",
    "Do you think there is life after death?",
    "What do you think would be humanity’s reaction to the discovery of extraterrestrial life?",
    "What are numbers?",
    "Where does the soul live?",
    "Why do we dream?",
    "Is it possible to live a normal life and not ever tell a lie?",
    "Does a person’s name influence the person they become?",
    "What should be the goal of humanity?",
    "If you could become immortal on the condition you would NEVER be able to die or kill yourself, would you choose immortality?",
    "How do you know that your experience of consciousness is the same as other people’s experience of consciousness?",
    "What are colors?",
    "If every neuron in a human was accurately simulated in a computer, would it result in human consciousness?",
    "Is it more important to be liked or respected?",
    "Why are humans so fascinated with mass murderers if their actions are universally considered evil and vile?",
    "What’s the most important question to ask someone when you meet them for the first time?",
    "Would you kill ten people to save 1?",
    "Is the life of one human worth more than the life of another?",
    "What is the best way for a person to attain happiness?",
    "If you could teach everyone in the world one concept, what concept would have the biggest positive impact on humanity?",
    "Is it possible to live a meaningful life without telling a single lie?",
    "Do you make your own choices or let others make them for you?",
    "Would it be more terrifying to discover that humans are the most advanced species in the universe or that we are far from being the most advanced?",
    "What is true strength?",
    "What is true love?",
    "Is a family still relevant in the modern world?",
    "What role does honor play in today’s society?",
    "If money cannot buy happiness, can you ever be truly happy with no money?",
    "How should people live their lives?",
    "If you could start over, what would you do differently?",
    "When does consciousness begin?",
    "What is the most important lesson you've learned in life?",
    "What is the difference between living and existing?",
    "If a higher power controls our fate, do we truly have free will?",
    "What defines you?",
    "What do you think your future self will remember about you now?",
    "Is suffering a necessary part of the human condition? What would people who never suffered be like?",
    "Does nature shape our personalities more than nurture?",
    "Should people be judged by their actions, intentions, or both?",
    "What is the most important goal every person should have?",
    "Is it more important to help yourself, help your family, help your society, or help the world?",
    "What is the most important thing a person can do to improve themselves?",
    "Should the general population be involved in the decision-making in a country’s government?",
    "Why do people expect a universe full of randomness to be fair?",
    "With no laws or rules to influence your behavior, how do you think you would behave?",
    "What’s something that will always be in fashion, no matter how much time passes?",
    "What is the difference between living and being alive?",
    "Is a life that is safe but boring better than a life full of risk and excitement?",
    "What does intimacy mean to you?",
    "How do you define a satisfying sexual relationship?",
    "What are some fantasies you'd be willing to explore?",
    "How important is physical intimacy to you in a relationship?",
    "What are some things that you feel absolutely off-limits in bed?",
    "How do you feel about the role of foreplay?",
    "What kind of touch makes you feel most loved?",
    "Is there a type of clothing you'd like me to wear more often?",
    "What is one thing that I do that makes you feel desired?",
    "How do you feel about the frequency of our intimacy?",
    "Are there any new locations you'd like to explore intimacy in?",
    "What kind of spoken words increase your arousal?",
    "Is there a role-play scenario you find intriguing?",
    "How do you feel about the use of toys in the bedroom?",
    "What are your thoughts on trying different positions?",
    "How do you feel about the lights on or off during intimacy?",
    "What kind of lingerie or attire do you find most appealing?",
    "How can I make you feel more comfortable and relaxed during intimate moments?",
    "What part of foreplay do you enjoy the most?",
    "Are there any specific actions or gestures that you find particularly arousing?",
    "What is your opinion on the importance of aftercare?",
    "How can we better communicate our needs and desires to each other?",
    "What kind of affection do you enjoy most outside the bedroom?",
    "Is there a particular time of day when you feel most amorous?",
    "How do you feel about expressing our sexual desires verbally?",
    "What is one thing that you've always wanted to try but haven't yet?",
    "Do you have any specific turn-ons that you'd like to share?",
    "What does sexual fulfillment look like for you?",
    "How can we improve our sexual connection?",
    "What are your thoughts on mutual masturbation?"
]
