{
  "version": "1.0.2",
  "questions": [
    "What was your funnest subject in high school & which one did you dread?",
    "What is one attribute of your mother that you see in yourself?",
    "How did your mother and father meet?",
    "Who would you like to have a closer relationship with?",
    "What do you think happens to you when you die?",
    "Would you rather be on the cover of Time, People or Food & Wine magazine?",
    "What would you do with one week to do anything, all expenses paid?",
    "Would you rather be a painter, writer or musician?",
    "Do you think you are hard on yourself?",
    "Do you have any phobias?",
    "When home alone, do you shut the door when you use the bathroom?",
    "If you could afford it at this moment, what would you buy?",
    "What is the greatest goal you want to achieve in the next five years?",
    "What are five things you are grateful for?",
    "If you could own the world’s largest collection of anything, what would it be?",
    "What is the most boring thing you can think of doing?",
    "What one month on the calendar would you like to eliminate?",
    "What age would you like to be for the rest of your life?",
    "What would you like to build if you knew how?",
    "What signs of aging are you starting to see in yourself?",
    "What is your favorite smell?",
    "What was your favorite toy as a kid?",
    "Would you rather skydive or bungee jump?",
    "What is your ideal type of party to attend?",
    "Who was your favorite teacher and why?",
    "What was your favorite family tradition?",
    "Have you ever won anything?",
    "Who was the best boss you ever had?",
    "What would an ideal day look like?",
    "Which game show would you like to be on?",
    "If you weren’t doing what you do now for a career, what would you do?",
    "If you won a multi-million dollar lottery what would you do with the money?",
    "What famous person would you want to meet?",
    "What is your favorite memory about us?",
    "Would you like to be famous? For what?",
    "If you could change something about the way you were raised what would it be?",
    "What super power do you wish you had?",
    "Have you ever stolen anything before?",
    "What grosses you out?",
    "Did you have any pets growing up?",
    "What is the scariest thing you’ve ever done?",
    "When’s the last time you cried?",
    "What do you hope your life looks like in five years?",
    "What do you want to be remembered for?",
    "What is one thing you wish that you were really good at?",
    "What is your favorite childhood memory?",
    "What did you want to be when you grew up?",
    "What did your parent name you after?",
    "What hobby would you like to take up together?",
    "What is the worst job you ever had?"   
    "What values are most important to you in our relationship?",
    "How can we support each other's personal growth?",
    "What does intimacy mean to you?",
    
  ]
}
